In [13]:
import numpy as np
import pandas as pd

In [14]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
pd.DataFrame(data)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [15]:
data_list=[
    ['John', 28, 'new york',65000 ],
    ['anna', 34, 'paris', 42000],
    ['peter', 29, 'Berlin', 62000],
    ['linda', 42, 'london', 85000]
]

In [16]:
df2=pd.DataFrame(data_list)

In [17]:
df2

       0   1         2      3
0   John  28  new york  65000
1   anna  34     paris  42000
2  peter  29    Berlin  62000
3  linda  42    london  85000

In [18]:
headers=["name","age","city","salary"]
df2=pd.DataFrame(data_list,columns=headers)
df2

    name  age      city  salary
0   John   28  new york   65000
1   anna   34     paris   42000
2  peter   29    Berlin   62000
3  linda   42    london   85000

selection and indexing of the coloums

In [19]:
df2["name"]

0     John
1     anna
2    peter
3    linda
Name: name, dtype: str

In [20]:
df2[["name","city"]]

    name      city
0   John  new york
1   anna     paris
2  peter    Berlin
3  linda    london

creating  a new coloum

In [21]:
df2["role"]=["lawyer","doctor","police","singer"]
df2

    name  age      city  salary    role
0   John   28  new york   65000  lawyer
1   anna   34     paris   42000  doctor
2  peter   29    Berlin   62000  police
3  linda   42    london   85000  singer